/**
 * @mainpage
 * <b> Лабораторна робота № 2. <br/> Розробка лінійних програм. Робота з числовими типами даних.  Константи. </b>
 * <br/><b><i>Мета роботи:</i></b> Придбати практичні навички з розробки лінійних програм.  <br/>

 * <b><i>Індивідуальне завдання:</i></b>
 * розробка програми, що переводить градуси за Цельсієм у градуси за Фаренгейтом і навпаки. <br/>
 * <b><i>Типи об’єктів та їх поля:</i></b> градуси за Цельсієм, градуси за Фаренгейтом.
 *
 * @author Momot R.
 * @date 08-sep-2019
 * @version 1.0
 */
