/**
 * @mainpage
 * <b> Лабораторна робота № 16. Макроси </b>
 * <br/><b>Мета роботи:</b>: Придбати практичні навички щодо розроблення програм з використанням макросів.  <br/>
 * <b>Індивідуальне завдання:</b>
 * Для попередньо розробленого функціоналу по роботі з прикладною областю за допомогою макровизначень зробити наступну «кастомізацію»: якщо визначене макровизначення DEBUG, то при виклику кожної функції роботи з прикладною областю виконувати таке:
 * виводити поточну дату та час;
 * виводити ім’я поточної функції;
 * при завершенні програми вивести загальний час роботи програми. <br/>
 * @author Momot R.
 * @date 23-dec-2019
 * @version 2.0
 */
#include "header.h"
int main()
{
	setlocale(LC_ALL, "Russian");						/**- Русіфікація консолі.*/
	start;
	Date;												/**- Виведення дати. */
	Time;												/**- Виведення поточного часу. */
	int count = 0;										/**- Оголошення змінної правильно виконаних тестів.*/

	bool test_size = Test_Size();						/**- Виклик функції тестування функції Size.*/
	if (test_size == true)								/**Якщо тест був виконаний правильно:*/
	{
		printf("Тест 1 выполнен удачно.\n");
		count++;										/**Збільшення змінної правильно виконаних тестів.*/
	}
	else printf("Тест 1 пройден с ошибкой.\n");

	bool test_percent = Test_Percent();
	if (test_percent == true)							/**Якщо тест був виконаний правильно:*/
	{
		printf("Тест 2 выполнен удачно.\n");
		count++;										/**Збільшення змінної правильно виконаних тестів.*/
	}
	else printf("Тест 2 пройден с ошибкой.\n");

	if (count == 2) printf("\nВсе тесты выполнены успешно.");	/**- Виведення повідомлення у консоль якщо усі тести виконані правильно.*/
	else printf("\nНе все тесты выполнены удачно.");	/**- Виведення повідомлення у консоль якщо не усі тести виконані правильно.*/

	fin;
	TimeOfWork;											/**- Виведення часу роботи програми. */

	if (_CrtDumpMemoryLeaks())							/**- Перевірка витоків пам'яті.*/
		printf("\nОбнаружена утечка памяти.");
	else
		printf("\nУтечка памяти отсутствует.");

	return 0;
}

bool Test_Size()
{
	FunctionName;									/**- Виведення у консоль назви функції.*/

	char test_text[] = { "Quantum computing is the study of a non-classical model of computation." };	/**- Оголошення змінної вхідних даних для тестування.*/
	int expected = 71;								/**- Оголошення змінної очікуваного результату тестування.*/
	int test_size = Size(test_text);				/**- Виклик функції Size.*/
	
	if (test_size == expected) return true;			/**- Якщо тест був виконан правильно, повертання змінної true.*/
	return false;									/**- Якщо тест не був виконан правильно, повертання змінної false.*/
}
bool Test_Percent()
{
	FunctionName;									/**- Виведення у консоль назви функції.*/

	float numbers[] = { 20.0, 30.0, 50.0 };			/**- Оголошення змінної вхідних даних для тестування.*/
	float expected = 25;							/**- Оголошення змінної очікуваного результату тестування.*/
	float test_percent = Percent(numbers[0], numbers[1], numbers[2]);	/**- Виклик функції Percent.*/

	if (test_percent == expected) return true;		/**- Якщо тест був виконан правильно, повертання змінної true.*/
	return false;									/**- Якщо тест не був виконан правильно, повертання змінної false.*/
}
