/**
 * @mainpage
 * <b> Лабораторна робота № 8. Покажчики </b>
 * <br/><b>Мета роботи:</b>: придбати практичні навички щодо розроблення програм з динамічно створеними даними. <br/>
 * <b>Індивідуальне завдання:</b>
 * Дано масив з N речовинних чисел. Розмістити всі елементи з позитивними значеннями в лівій частині масиву, елементи з негативними значеннями – у правій, а нулі – між ними. <br/>
 * <b>Типи обєктів та їх поля: </b> float* pm;
 * @author Momot R.
 * @date 14-oct-2019
 * @version 1.0
 */

#define CRTDBG_MAP_ALLOC                          
#include <crtdbg.h>							 /**< Підключення бібліотеки відстеження витоку пам'яті. */
#define DEBUG_NEW new(_NORMAL_BLOCK, __FILE, LINE)
#define new DEBUG_NEW

#include <stdlib.h>                          /**< Підключення бібліотеки "stdlib.h". */
#include <malloc.h>							 /**< Підключення бібліотеки "malloc.h". */
#define N 6                                  /**< Оголошення розміру масиву. */
void Form(float*);							 /**< Оголошення функції формування масиву. */
void Transposition(float*, int);             /**< Оголошення функції перестановки масиву. */

/**
  * Головна функція.
  *
  * Послідовність дій:
  * <ul>
  * <li> Створення змінних </li>
  * <li> Виклик функції генерації масиву </li>
  * <li> Виклик функції перестановки елементів масиву  </li>
  * </ul>
*/

int main()
{
	float* pm;							     /**< Оголошення динамічного масиву. */
	pm = (float*)malloc(sizeof(float) * N);  /**< Виділяємо пам'ять для динамічного масиву. */

	Form(pm);                                /**< Виклик функції генерації масиву. */
	Transposition(pm, N);                    /**< Виклик функції перестановки масиву. */        

	free(pm);                                /**< Звільнення пам'яті. */        

	char b;                
	if (_CrtDumpMemoryLeaks == 1)            /**< Перевіряємо витоки пам'яті. */  
		b = 'e'; //витоки є      
	else
		b = 'g'; //немає витоків

	return 0;
}

void Form(float* pm)                       
{
	for (int i = 0; i < N; i++)				/**< Цикл, який визначає елемент, який треба заповнити. */        
		* (pm++) = rand() % 20 + (-9.99);   /**< Заповнюємо елемент речовинним числом. */        
}

void Transposition(float* pm, int size)     
{
	float temp;								/**< Змінна, необхідна для перестановки елементів масиву. */        

	for (int i = 0, l = -1; i < size - 1; i++, l--) /**< Цикл, який визначає елементи, які треба переставити. */       
		if (*(pm + i) < 0 && *(pm + size + l) > 0)  /**< Визначаємо чи потрібно переставляти єлементи. */ 
		{
			temp = *pm;
			*pm = *(pm + size + l);         /**< Міняємо елементи місцями. */ 
			*(pm + size + l) = temp;
		}
}