/**
*@mainpage
* <b> Лабораторна робота № 15. Двозв’язні списки </b>
* <br/><b>Мета роботи:</b> придбати практичні навички щодо розробки програм з динамічними структурами даних. Освоїти методи обробки двозв’язних списків.<br/>
* <b>Індивідуальне завдання:</b>
* Прикладна галузь «НОУТБУК».Сформувати односпрямований список ноутбуків, у яких кількість клавіш знаходиться у діапазоні від 80 до 101. <br/>
* <b>Типи обєктів та їх поля: </b> НОУТБУК: Розмір діагоналі екрану; назва фірми; назва моделі; Чи є Bluetooth ?; кількість клавіш на клавіатурі; ціна; операційна система.
* @author Momot R.
* @date 9-dec-2019
* @version 2.5
*/
#include "my.h"
int main() {
	setlocale(LC_ALL, "Rus");			/**- Русіфікація консолі.*/
	struct NotebookElSp* h = Init();	/**- Виклик функції ініціалізації голови списку. */
	struct NotebookElSp* t = Init();	/**- Виклик функції ініціалізації хвоста списку. */
	FILE* text = OpenFile();			/**- Виклик функції відкриття файлу. */
	if (text == NULL)					/**Якщо файл з даними не існує: */
	{
		printf("Файл не открыт. Завершение роботы.");
		FreeSpisok(h);		/**Виклик функції очищення списку. */
		return 0;			/**Закінченя роботи програми. */
	}
	InitSpisok(h, t);			/**- Виклик функції об'єднання голови списку та хвоста. */
	Choise(h,t,text);			/**- Виклик функції вибору заповнення програми. */
	Menu(h,t);					/**- Виклик функції вибору дій зі списком. */

	return 0;					/**- Завершення роботи програми.*/
}

