#include "header.h";

bool ReadFile(char* text1, char* text2)
{
	FILE* Text1;
	Text1 = fopen("text1.txt", "r");    /**- Відкриття першого файлу. */
	if (Text1 == NULL)                  /**- Перевірка на існування файлу з текстом. */
		return false;
	fgets(text1, N, Text1);             /**- Запис з першого файлу у масив 1. */
	fclose(Text1);                      /**- Закриття першого файлу. */

	FILE* Text2;
	Text2 = fopen("text2.txt", "r");    /**- Відкриття другого файлу. */
	if (Text2 == NULL)					/**- Перевірка на існування файлу з текстом. */
		return false;
	fgets(text2, N, Text2);				/**- Запис з другого файлу у масив 2. */
	fclose(Text2);						/**- Закриття другого файлу. */

	return true;
}
int Size(char text[])
{
	int size = 0, i = 0;		/**- Оголошення змінних, необхідних для знаходження розміру масиву. */

	do {
		size++;                 /**- Збільшення змінної розміру тексту на 1. */
		i++;					/**- Збільшення змінної елементів тексту на 1. */
	} while (text[i] != '\0');  /**- Цикл, який визначає розмір масиву. */

	return size - 1;			/**- Повернення результату роботи функції. */
}
int Comparison(char* text1, char* text2, int size1, int size2)
{
	int num = 0;						/**- Змінна, необхідна для роботи функції. */

	for (int i = 0; i < size1; i++)     /**- Цикл, який знаходить елемент першого тексту. */
		for (int j = 0; j < size2; j++)	/**- Цикл, який знаходить елемент другого тексту. */
			if (*(text1 + i) == *(text2 + j) && *(text1 + i) != ' ') /**- Оператор, який перевіряє збіг елементів текстів. */
			{
				num++;					/**- Збільшення змінної збігів елементів на 1. */
				*(text2 + j) = '+';		/**- Заміна символу у тексті 2 для уникнення повторних збігів. */
				j = j + size2;			/**- Закінчення порівняння з елементом тексту 1. */
			}

	return num;                         /**- Повернення змінної збігів елементів. */
}

float Percent(float MatchedNumber, float size1, float size2)
{	
	float result = 100 / ((size1 + size2) / MatchedNumber);	/**- Знаходження змінної відсотка збігів символів. */
	return result;						/**- Повернення відсотка збігів. */
}


