/**
 * @mainpage
 * <b> Лабораторна робота № 13. Модульне тестування </b>
 * <br/><b>Мета роботи:</b>: придбати практичні навички з розробки модульних тестів.  <br/>
 * <b>Індивідуальне завдання:</b>
 * Для попередньо розробленого функціоналу по роботі з прикладною областю,  додати методи – модульні тести, що демонструють коректність роботи розробленого функціоналу. <br/>
 * <b>Типи обєктів та їх поля: </b> int count, bool test_size, bool test_percent;
 * @author Momot R.
 * @date 16-oct-2019
 * @version 1.2
 */
#include "header.h"

int main()
{
	setlocale(LC_ALL, "Russian");					/**- Русіфікація консолі.*/
	int count = 0;									/**- Оголошення змінної правильно виконаних тестів.*/

	bool test_size = Test_Size();					/**- Виклик функції тестування функції Size.*/
	if (test_size == true)							/**Якщо тест був виконаний правильно:*/
	{
		printf("Тест 1 выполнен удачно.\n");
		count++;									/**- Збільшення змінної правильно виконаних тестів.*/
	}
	else printf("Тест 1 пройден с ошибкой.\n");

	bool test_percent = Test_Percent();				/**- Виклик функції тестування функції Percent.*/
	if (test_percent == true)						/**Якщо тест був виконаний правильно:*/
	{
		printf("Тест 2 выполнен удачно.\n");
		count++;									/**- Збільшення змінної правильно виконаних тестів.*/
	}
	else printf("Тест 2 пройден с ошибкой.\n");

	if (count == 2) printf("Все тесты выполнены успешно.\n");	/**- Виведення повідомлення у консоль якщо усі тести виконані правильно.*/
	else printf("Не все тесты выполнены удачно.\n");			/**- Виведення повідомлення у консоль якщо не усі тести виконані правильно.*/

	if (_CrtDumpMemoryLeaks())						/**- Перевірка витоків пам'яті.*/
		printf("\nОбнаружена утечка памяти.");
	else
		printf("\nУтечка памяти отсутствует.");

	return 0;
}


bool Test_Size()
{
	char test_text[] = { "Quantum computing is the study of a non-classical model of computation." };	/**- Оголошення змінної вхідних даних для тестування.*/
	int expected = 70;							/**- Оголошення змінної очікуваного результату тестування.*/
	int test_size = Size(test_text);			/**- Виклик функції Size.*/
	if (test_size == expected) return true;		/**- Якщо тест був виконан правильно, повертання змінної true.*/
	return false;								/**- Якщо тест не був виконан правильно, повертання змінної false.*/
}
bool Test_Percent()
{
	float numbers[] = { 20.0, 30.0, 50.0 };		/**- Оголошення змінної вхідних даних для тестування.*/
	float expected = 25;						/**- Оголошення змінної очікуваного результату тестування.*/
	float test_percent = Percent(numbers[0], numbers[1], numbers[2]);	/**- Виклик функції Percent.*/
	if (test_percent == expected) return true;	/**- Якщо тест був виконан правильно, повертання змінної true.*/
	return false;								/**- Якщо тест не був виконан правильно, повертання змінної false.*/
}

