/**
 * @mainpage
 * <b> Лабораторна робота № 9. Форматоване введення/виведення даних за допомогою функцій printf / scanf. </b>
 * <br/><b>Мета роботи:</b> придбати практичні навички щодо розроблення програм із використанням консольного стандартного введення/виведення. <br/>
 * <b>Індивідуальне завдання:</b>
 * Дано масив з N речовинних чисел. Розмістити всі елементи з позитивними значеннями в лівій частині масиву, елементи з негативними значеннями – у правій, а нулі – між ними. <br/>
 * <b>Типи обєктів та їх поля: </b> float* pm;
 * @author Momot R.
 * @date 21-oct-2019
 * @version 1.0
 */

#define CRTDBG_MAP_ALLOC
#include <crtdbg.h>				       /**< Підключення бібліотеки відстеження витоків пам'яті. */
#define DEBUG_NEW new(_NORMAL_BLOCK, __FILE, LINE)
#define new DEBUG_NEW

#include <time.h>					   /**< Підключення бібліотеки для рандомізації генерації чисел. */
#include <stdlib.h>					   /**< Підключення бібліотеки для генерації чисел та виділення пам'яті. */
#include <stdio.h>					   /**< Підключення бібліотеки для вводу та виводу інформації. */
#include <locale.h>                    /**< Підключення бібліотеки для локалізації консолі. */
void Form(float*, int);			       /**< Оголошення функції формування масиву. */
void Transposition(float*, int);       /**< Оголошення функції сортування масиву. */
int main()
{
	setlocale(LC_ALL, "Rus");
	float* pm;					                /**< Оголошення динамічного масиву. */
	int size = 0;
	int choise;

	printf("Введите количество элементов: ");
	scanf_s(" %i", &size);						/**< Введення розміру масива. */

	pm = (float*)malloc(sizeof(float) * size);  /**< Виділяємо пам'ять для динамічного масиву. */

	printf("\nГенерировать массив(0) или вводить с клавиатуры(1): ");
	scanf_s(" %i", &choise);					/**< Вибір варіантів заповнення масива. */
	if (choise == 1)
	{
		printf("\nВведите массив: \n");
		for (int i = 0; i < size; i++)			/**< Цикл, який визначає елемент, який треба заповнити. */
			scanf_s(" %f", &*(pm + i));			/**< Заповнення масиву з клавіатури. */
	}
	else
	{
		Form(pm, size);							/**< Виклик функції генерації масиву. */
		printf("\nСгенерированный массив: \n");
		for (int i = 0; i < size; i++)		    /**< Цикл, який визначає елемент, який треба вивести. */
			printf("%8.2f", *(pm + i));			/**< Виведення елементу сгенерованого масиву. */
	}
	Transposition(pm, size);					/**< Виклик функції перестановки масиву. */

	printf("\nРезультат: \n");
	for (int i = 0; i < size; i++)				/**< Цикл, який визначає елемент, який треба вивести. */
		printf("%8.2f", *(pm + i));				/**< Виведення елементу сгенерованого масиву. */

	free(pm);									/**< Звільнення пам'яті. */

	if (_CrtDumpMemoryLeaks == 1)			    /**< Перевіряємо витоки пам'яті. */
		printf("\nЕсть утечка\n");				/**< Виведення інформації, що витоки є. */
	else
		printf("\n\nУтечка отсутствует\n");		/**< Виведення інформації, що витоків немає. */

	return 0;
}

void Form(float* pm, int size)              
{
	for (int i = 0; i < size; i++)				/**< Цикл, який визначає елемент, який треба заповнити. */
		* (pm++) = rand() % 20 + (-9.99);		/**< Заповнення елемента масиву сгенерованим речовинним числом. */
}

void Transposition(float* pm, int size)
{
	float temp;									/**< Змінна, необхідна для перестановки елементів масиву. */
	
	for (int i = 0; i < size; i++)				/**< Цикл, який визначає елемент, який треба заповнити. */
		for (int j = 1 + i; j < size; j++)
			if ((*(pm + i) < 0 || *(pm + i) == 0) && (*(pm + j) > 0 || *(pm + j) == 0)) /**< Перевірка потрібності перестановки елементів. */
			{
				temp = *(pm + i);
				*(pm + i) = *(pm + j);
				*(pm + j) = temp;
			}
}