/**
 * @mainpage
 * <b> Лабораторна робота № 7. Багатовимірні масиви </b>
 * <br/><b>Мета роботи:</b>: Придбати практичні навички щодо розроблення програм з використанням  функцій користувача, функції генерації псевдовипадкових чисел, а також передачі масиву як аргументу функції. <br/>
 * <b>Індивідуальне завдання:</b>
 * Дано двовимірний масив з N*М речовинних чисел. Кожний елемент рядка матриці помножити на випадкове число (числа-множники для різних рядків мають бути різними). <br/>
 * <b>Типи обєктів та їх поля: </b> float mas[N * M], float mas2[N][M], int mnojitel;
 * @author Momot R.
 * @date 07-oct-2019
 * @version 1.0
 */

#include <stdlib.h>                     /**< Підключення бібліотеки "stdlib.h". */
#define N 2							    /**< Оголошення кількості рядків масиву. */
#define M 3                             /**< Оголошення кількості стовбців масиву. */
float Form(float mas[]);                /**< Оголошення функції формування масиву. */
float Multiplication(float mas[]);      /**< Оголошення функції множення масиву. */

/**
  * Головна функція.
  *
  * Послідовність дій:
  * <ul>
  * <li> Створення змінних </li>
  * <li> Виклик функції генерації масиву </li>
  * <li> Виклик функції множення масиву на випадкове число  </li>
  * </ul>
*/

int main()
{
	float mas[N * M];         /**< Оголошення початкового масиву речовинних чисел N * M розміру. */
	
	Form(mas);                /**< Виклик функції генерації масиву. */        
	Multiplication(mas);      /**< Виклик функції переводу одномірного масиву у двумірний і множення кожного рядка. */ 
}

float Form(float mas[])                                                            
{
	int i;                                  /**< Змінна, потрібна для роботи програми. */

	for (i = 0; i < N * M; i++)             /**< Цикл заповлення масиву речовинними числами. */
		mas[i] = rand() % 20 + (-9.99);     /**< Генерація числа від -9.99 до 10.01. */
		
	return mas[i];                          /**< Повернення заповненого масиву. */
}

float Multiplication(float mas[])
{
	float mas2[N][M];                              /**< Оголошення двомірного масиву, який буде результатом виконання. */

	int mnojitel, i, j, l;                         /**< Змінні, які необхідні для роботи програми. */

	for (i = 0, l = 0; i < N; i++)                 /**< Цикл, який визначає рядок у який будуть записуватися елементи. */
	{
		mnojitel = rand() % 9;                     /**< Присвоєння змінній випадково сгенероване число. */
		for (j = 0; j < M; j++)                    /**< Цикл, який визначає стовбець у який будуть записуватися елементи. */
			mas2[i][j] = mas[l++] * mnojitel;      /**< Присвоєння i-ому елементу j-ого стовбця значення одномірного масива, помноженого на число. */
	}
	return mas[l];
}
