//Отримати рядковий еквівалент переданого символу, якщо цей символ – заголовна буква. Наприклад, ‘А’ -> ‘а’, ‘х’ -> ‘Х’.
//Лабораторна робота №6
char perevod(int a);                    //оголошуємо функцію зміни регістра букви
int main()
{
	perevod('J');                       //вводимо букву, еквівалент якої треба повернути
}

char perevod(int a)
{
	char c, error;

	if (a >= 65 && a <= 90)            //якщо це літера верхнього регістру
		{
			c = (int)a + 32;
			return (char)c;
		}

	if (a >= 97 && a <= 122)          //якщо це літера нижнього регістру
		{
			c = (int)a - 32;
			return (char)c;
		}

	else
		{
			error = 'e';
			return 'e';
		}

}
